In this section, we will investigate each dataset in order to better predict.

### Import Libraries

In [1]:
import numpy as np
import pandas as pd
import re
import os
import pickle
from scipy.stats import shapiro, ttest_ind, chi2, mannwhitneyu

### Import data

In [2]:
holiday = pd.read_csv('../data/holidays_events.csv')
oil = pd.read_csv('../data/oil.csv')
store = pd.read_csv('../data/stores.csv')
transaction = pd.read_csv('../data/transactions.csv')
train = pd.read_csv('../data/train.csv')
test = pd.read_csv('../data/test.csv')

### Helper

In [274]:
def print_summary(data):
    """This function will print out the data summary within our data frame.
    It will print out the results including data type, mean, median, standard deviation, missing values and so on.
    
    Input:
    data -> dataframe 
    
    Output:
    summary -> statistical summary of the data frames"""
    
    for col, ctype in data.dtypes.items():
        missing = data[col].isnull().sum()
        summary = data[col].describe()
        total = len(data[col])
        print(f"Total number of rows: {total}")
        print(f"Missing value: {missing}")
        print(f"{col} summary: ")
        print(summary)
       
        print('-' * 50)

In [4]:
def create_new_path(path):
    
    """This function will create a new folder.
    
    Input: 
    path -> str (specify the path you want to create)
    """
    
    # try to create a new path in our data
    # if folders are already existed, then will get an error message
    try: 
        os.mkdir(path) 
    except OSError as e: 
        print(e)

### Create new folders

In [5]:
output_path = '../output'
asset_path = '../asset'

In [6]:
for path in [output_path, asset_path]:
    create_new_path(path)

[Errno 17] File exists: '../output'
[Errno 17] File exists: '../asset'

### Investigate

Since we have few different data frames, we need to investigate each data further.

- holiday

In [275]:
holiday.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [276]:
holiday.tail()

           date        type    locale locale_name description  transferred
345  2017-12-22  Additional  National     Ecuador   Navidad-3        False
346  2017-12-23  Additional  National     Ecuador   Navidad-2        False
347  2017-12-24  Additional  National     Ecuador   Navidad-1        False
348  2017-12-25     Holiday  National     Ecuador     Navidad        False
349  2017-12-26  Additional  National     Ecuador   Navidad+1        False

In [277]:
holiday.type.value_counts()

Holiday       221
Event          56
Additional     51
Transfer       12
Bridge          5
Work Day        5
Name: type, dtype: int64

It looks like data description is in Spanish. Can we use description column later or?

In [278]:
holiday.transferred.value_counts()

False    338
True      12
Name: transferred, dtype: int64

There are some trasnferred holidays

In [279]:
holiday.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         350 non-null    object
 1   type         350 non-null    object
 2   locale       350 non-null    object
 3   locale_name  350 non-null    object
 4   description  350 non-null    object
 5   transferred  350 non-null    bool
dtypes: bool(1), object(5)
memory usage: 14.1+ KB

Relatively smaller. 350 rows total and looks like we do not have missing values. One thing to note is that the column date is in character values. It might be beneficial to change the column to datetime object.

In [280]:
holiday.loc[:, 'date'] = pd.DatetimeIndex(holiday.date)

In [281]:
print_summary(holiday)

Total number of rows: 350
Missing value: 0
date summary:
count                     350
unique                    312
top       2014-06-25 00:00:00
freq                        4
first     2012-03-02 00:00:00
last      2017-12-26 00:00:00
Name: date, dtype: object
--------------------------------------------------
Total number of rows: 350
Missing value: 0
type summary:
count         350
unique          6
top       Holiday
freq          221
Name: type, dtype: object
--------------------------------------------------
Total number of rows: 350
Missing value: 0
locale summary:
count          350
unique           3
top       National
freq           174
Name: locale, dtype: object
--------------------------------------------------
Total number of rows: 350
Missing value: 0
locale_name summary:
count         350
unique         24
top       Ecuador
freq          174
Name: locale_name, dtype: object
--------------------------------------------------
Total number of rows: 350
Missing value: 0
description summary:
count          350
unique         103
top       Carnaval
freq            10
Name: description, dtype: object
--------------------------------------------------
Total number of rows: 350
Missing value: 0
transferred summary:
count       350
unique        2
top       False
freq        338
Name: transferred, dtype: object
--------------------------------------------------

/var/folders/t9/5hgq421x4xsgvkp8nd2kx4fw0000gn/T/ipykernel_49103/3715482436.py:7: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  summary = data[col].describe()

A quick data summary for the dataset. We may be able to join the date column. Might be some sort of seasonality.

- oil

In [282]:
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [283]:
oil.tail()

            date  dcoilwtico
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

In [284]:
oil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1218 non-null   object
 1   dcoilwtico  1175 non-null   float64
dtypes: float64(1), object(1)
memory usage: 19.2+ KB

In [285]:
oil.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [286]:
oil.loc[:, 'date'] = pd.to_datetime(oil.date)

Still relatively small. The price of gas on a given date. Notice that the date column is also in character, so we need to convert it.

In [287]:
oil.loc[:, 'date'] = pd.DatetimeIndex(oil.date)

In [288]:
print_summary(oil)

Total number of rows: 1218
Missing value: 0
date summary:
count                    1218
unique                   1218
top       2013-01-01 00:00:00
freq                        1
first     2013-01-01 00:00:00
last      2017-08-31 00:00:00
Name: date, dtype: object
--------------------------------------------------
Total number of rows: 1218
Missing value: 43
dcoilwtico summary:
count    1175.000000
mean       67.714366
std        25.630476
min        26.190000
25%        46.405000
50%        53.190000
75%        95.660000
max       110.620000
Name: dcoilwtico, dtype: float64
--------------------------------------------------

/var/folders/t9/5hgq421x4xsgvkp8nd2kx4fw0000gn/T/ipykernel_49103/3715482436.py:7: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  summary = data[col].describe()

some missing value in this dataframe.

In [289]:
oil.fillna(method = 'ffill', inplace = True)

For the oil price, there are some missing valeus. Therefore, we can impute these missing values using the historical price. This might not be necessarily true, but it should not fluctuate that much, so for now we can use previous values.

In [290]:
oil.fillna(method = 'bfill', inplace = True)

The first row has a missing value (1/1/13). Assuming this happened because of the new year, but let's use the price of 1/2/13 for this specific row.

In [291]:
oil.to_csv('../output/complete_oil.csv', index = False)

- store

In [292]:
store.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [293]:
store.tail()

    store_nbr       city       state type  cluster
49         50     Ambato  Tungurahua    A       14
50         51  Guayaquil      Guayas    A       17
51         52      Manta      Manabi    A       11
52         53      Manta      Manabi    D       13
53         54  El Carmen      Manabi    C        3

In [294]:
store.type.value_counts()

D    18
C    15
A     9
B     8
E     4
Name: type, dtype: int64

In [295]:
store.cluster.value_counts().sort_index()

1     3
2     2
3     7
4     3
5     1
6     6
7     2
8     3
9     2
10    6
11    3
12    1
13    4
14    4
15    5
16    1
17    1
Name: cluster, dtype: int64

In [296]:
store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_nbr  54 non-null     int64
 1   city       54 non-null     object
 2   state      54 non-null     object
 3   type       54 non-null     object
 4   cluster    54 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.2+ KB

store and cluster seem to be better with categorical values. need to change them into character

In [297]:
store.loc[:, 'store_nbr'] = store.store_nbr.apply(lambda x: str(x))
store.loc[:, 'cluster'] = store.cluster.apply(lambda x: str(x))

In [298]:
print_summary(store)

Total number of rows: 54
Missing value: 0
store_nbr summary:
count     54
unique    54
top        1
freq       1
Name: store_nbr, dtype: object
--------------------------------------------------
Total number of rows: 54
Missing value: 0
city summary:
count        54
unique       22
top       Quito
freq         18
Name: city, dtype: object
--------------------------------------------------
Total number of rows: 54
Missing value: 0
state summary:
count            54
unique           16
top       Pichincha
freq             19
Name: state, dtype: object
--------------------------------------------------
Total number of rows: 54
Missing value: 0
type summary:
count     54
unique     5
top        D
freq      18
Name: type, dtype: object
--------------------------------------------------
Total number of rows: 54
Missing value: 0
cluster summary:
count     54
unique    17
top        3
freq       7
Name: cluster, dtype: object
--------------------------------------------------

- transaction

In [299]:
transaction.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [300]:
transaction.tail()

             date  store_nbr  transactions
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

In [301]:
transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

non missing and not many columns. change date and store_sbr data type

In [302]:
transaction.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [303]:
transaction.tail()

             date  store_nbr  transactions
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

In [304]:
transaction.loc[:, 'date'] = pd.DatetimeIndex(transaction.date)
transaction.loc[:, 'store_nbr'] = transaction.store_nbr.apply(lambda x: str(x))

In [305]:
print_summary(transaction)

Total number of rows: 83488
Missing value: 0
date summary:
count                   83488
unique                   1682
top       2017-08-15 00:00:00
freq                       54
first     2013-01-01 00:00:00
last      2017-08-15 00:00:00
Name: date, dtype: object
--------------------------------------------------
Total number of rows: 83488
Missing value: 0
store_nbr summary:
count     83488
unique       54
top          39
freq       1678
Name: store_nbr, dtype: object
--------------------------------------------------
Total number of rows: 83488
Missing value: 0
transactions summary:
count    83488.000000
mean      1694.602158
std        963.286644
min          5.000000
25%       1046.000000
50%       1393.000000
75%       2079.000000
max       8359.000000
Name: transactions, dtype: float64
--------------------------------------------------

/var/folders/t9/5hgq421x4xsgvkp8nd2kx4fw0000gn/T/ipykernel_49103/3715482436.py:7: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  summary = data[col].describe()

- train

In [306]:
train.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [307]:
train.tail()

,id,date,store_nbr,family,sales,onpromotion
3000883,3000883,2017-08-15,9,POULTRY,438.133,0
3000884,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
3000885,3000885,2017-08-15,9,PRODUCE,2419.729,148
3000886,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
3000887,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [308]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000888 entries, 0 to 3000887
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   id           int64
 1   date         object
 2   store_nbr    int64
 3   family       object
 4   sales        float64
 5   onpromotion  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 137.4+ MB

for train, we have a good amount of data, but the number of columns is not that high. change their data type values accordingly.

check missing dates

In [309]:
train_check = train.set_index('date')

In [310]:
train_check.index = pd.to_datetime(train_check.index)

print(pd.date_range(start= min(train_check.index),
              end = max(train_check.index)).difference(train_check.index))

DatetimeIndex(['2013-12-25', '2014-12-25', '2015-12-25', '2016-12-25'], dtype='datetime64[ns]', freq=None)

For Christmas, looks like all the stores are closed.

In [312]:
christmas_df = pd.DataFrame()
copy = train[train.date == '2013-01-01']

for christmas in ['2013-12-25', '2014-12-25', '2015-12-25', '2016-12-25']:
    copy.loc[:,'date'] = christmas
    christmas_df = christmas_df.append(copy, ignore_index= True)

/var/folders/t9/5hgq421x4xsgvkp8nd2kx4fw0000gn/T/ipykernel_49103/1942604989.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  copy.loc[:,'date'] = christmas
/var/folders/t9/5hgq421x4xsgvkp8nd2kx4fw0000gn/T/ipykernel_49103/1942604989.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  christmas_df = christmas_df.append(copy, ignore_index= True)

In [313]:
train = pd.concat([train,  christmas_df]).drop(columns = 'id')

In [314]:
print_summary(train)

Total number of rows: 3008016
Missing value: 0
date summary:
count        3008016
unique          1688
top       2013-01-01
freq            1782
Name: date, dtype: object
--------------------------------------------------
Total number of rows: 3008016
Missing value: 0
store_nbr summary:
count    3.008016e+06
mean     2.750000e+01
std      1.558579e+01
min      1.000000e+00
25%      1.400000e+01
50%      2.750000e+01
75%      4.100000e+01
max      5.400000e+01
Name: store_nbr, dtype: float64
--------------------------------------------------
Total number of rows: 3008016
Missing value: 0
family summary:
count        3008016
unique            33
top       AUTOMOTIVE
freq           91152
Name: family, dtype: object
--------------------------------------------------
Total number of rows: 3008016
Missing value: 0
sales summary:
count    3.008016e+06
mean     3.569313e+02
std      1.100828e+03
min      0.000000e+00
25%      0.000000e+00
50%      1.100000e+01
75%      1.950000e+02
max      1.247170e+05
Name: sales, dtype: float64
--------------------------------------------------
Total number of rows: 3008016
Missing value: 0
onpromotion summary:
count    3.008016e+06
mean     2.596603e+00
std      1.220505e+01
min      0.000000e+00
25%      0.000000e+00
50%      0.000000e+00
75%      0.000000e+00
max      7.410000e+02
Name: onpromotion, dtype: float64
--------------------------------------------------

In [315]:
train.loc[:, 'date'] = pd.DatetimeIndex(train.date)
train.loc[:, 'store_nbr'] = train.store_nbr.apply(lambda x: str(x))

In [316]:
train.sort_values(by = ['date', 'store_nbr'], inplace = True)

- test

In [317]:
test.head()

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [318]:
test.tail()

            id        date  store_nbr                      family  onpromotion
28507  3029395  2017-08-31          9                     POULTRY            1
28508  3029396  2017-08-31          9              PREPARED FOODS            0
28509  3029397  2017-08-31          9                     PRODUCE            1
28510  3029398  2017-08-31          9  SCHOOL AND OFFICE SUPPLIES            9
28511  3029399  2017-08-31          9                     SEAFOOD            0

In [319]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           28512 non-null  int64
 1   date         28512 non-null  object
 2   store_nbr    28512 non-null  int64
 3   family       28512 non-null  object
 4   onpromotion  28512 non-null  int64
dtypes: int64(3), object(2)
memory usage: 1.1+ MB

change the data types accordingly.

In [320]:
test.loc[:, 'date'] = pd.DatetimeIndex(test.date)
test.loc[:, 'store_nbr'] = test.store_nbr.apply(lambda x: str(x))

check missing dates

In [321]:
test_check = test.set_index('date')

In [322]:
test_check.index = pd.to_datetime(test_check.index)

print(pd.date_range(start= min(test_check.index),
              end = max(test_check.index)).difference(test_check.index))

DatetimeIndex([], dtype='datetime64[ns]', freq=None)

In [323]:
print_summary(test)

Total number of rows: 28512
Missing value: 0
id summary:
count    2.851200e+04
mean     3.015144e+06
std      8.230850e+03
min      3.000888e+06
25%      3.008016e+06
50%      3.015144e+06
75%      3.022271e+06
max      3.029399e+06
Name: id, dtype: float64
--------------------------------------------------
Total number of rows: 28512
Missing value: 0
date summary:
count                   28512
unique                     16
top       2017-08-16 00:00:00
freq                     1782
first     2017-08-16 00:00:00
last      2017-08-31 00:00:00
Name: date, dtype: object
--------------------------------------------------
Total number of rows: 28512
Missing value: 0
store_nbr summary:
count     28512
unique       54
top           1
freq        528
Name: store_nbr, dtype: object
--------------------------------------------------
Total number of rows: 28512
Missing value: 0
family summary:
count          28512
unique            33
top       AUTOMOTIVE
freq             864
Name: family, dtype: object
--------------------------------------------------
Total number of rows: 28512
Missing value: 0
onpromotion summary:
count    28512.000000
mean         6.965383
std         20.683952
min          0.000000
25%          0.000000
50%          0.000000
75%          6.000000
max        646.000000
Name: onpromotion, dtype: float64
--------------------------------------------------

/var/folders/t9/5hgq421x4xsgvkp8nd2kx4fw0000gn/T/ipykernel_49103/3715482436.py:7: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  summary = data[col].describe()

### Combine data

After looking into data, we can combine the results

In [359]:
counts = pd.DataFrame(holiday.date.value_counts()).rename(columns = {'date':'holiday_counts'})

In [360]:
counts.loc[:, 'is_multiple'] = counts.holiday_counts.apply(lambda x: 1 if x > 1 else 0)

In [364]:
counts.reset_index(inplace = True)

In [367]:
counts = counts.rename(columns= {'index':'date'})

Let's use holiday counts rather the actual holiday dataframe since it causes duplicate issues.

In [383]:
holiday[holiday.transferred == True].to_pickle('../asset/transfer_holidays.pkl')

pickle transfer holidays

In [372]:
train_df = train.merge(oil, left_on= 'date', right_on = 'date', how = 'left').merge(counts, left_on= 'date', right_on= 'date', how = 'left').merge(store, left_on= 'store_nbr', right_on = 'store_nbr', how = 'left')

In [373]:
test_df =test.merge(oil, left_on= 'date', right_on = 'date', how = 'left').merge(counts, left_on= 'date', right_on= 'date', how = 'left').merge(store, left_on= 'store_nbr', right_on = 'store_nbr', how = 'left')

In [374]:
train_df.rename(columns= {'type_x':'holiday_type',
                          'type_y':'store_type'}, inplace = True)

In [375]:
test_df.rename(columns= {'type_x':'holiday_type',
                          'type_y':'store_type'}, inplace = True)

### Export data

In [378]:
train_df.to_pickle('../output/train_df.pkl')
test_df.to_pickle('../output/test_df.pkl')